Revit 2024 API
FamilySizeTableColumn Methods
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSpecTypeId
 Gets the identifier of the spec describing values in the column.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUnitTypeId
 Gets the identifier of the unit quantifying values in the column.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace